Core/src/Documents/Конвертация/Конвертация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Конвертация</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ОтчетПоКурсовымРазницам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПодотчетниками</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКонвертация</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтправитель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПолучатель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКлючВИнтернетБанке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/КурсыВалютБанков/КурсыВалютБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалютБанков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКросс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьКросс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсовВалютБанка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПокупки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПродажи</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/СтатусыДокументовВИнтернетБанке/СтатусыДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДокументовВИнтернетБанке</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокументаВИнтернетБанке</name>
    <type>
      <types>EnumRef.СтатусыДокументовВИнтернетБанке</types>
      <types>EnumRef.СтатусыПакетныхПеречисленийВИнтернетБанке</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ПлатежнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийКонвертация/ВидыОперацийКонвертация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКонвертация</name>
  <enumValues>
    <name>Касса</name>
  </enumValues>
  <enumValues>
    <name>Подотчетник</name>
  </enumValues>
  <enumValues>
    <name>СоСчета</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыКурсовВалютБанка/ВидыКурсовВалютБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКурсовВалютБанка</name>
  <enumValues>
    <name>Коммерческий</name>
  </enumValues>
  <enumValues>
    <name>Кросс</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СтатусыДокументовВИнтернетБанке/СтатусыДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовВИнтернетБанке</name>
  <enumValues>
    <name>C</name>
  </enumValues>
  <enumValues>
    <name>N</name>
  </enumValues>
  <enumValues>
    <name>D</name>
  </enumValues>
  <enumValues>
    <name>P</name>
  </enumValues>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
  <enumValues>
    <name>T</name>
  </enumValues>
  <enumValues>
    <name>R</name>
  </enumValues>
  <enumValues>
    <name>Z</name>
  </enumValues>
  <enumValues>
    <name>ПрисутствуетТолькоВТекущейБазе</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженИзИнтернетБанка</name>
  </enumValues>
  <enumValues>
    <name>INIT</name>
  </enumValues>
  <enumValues>
    <name>DR</name>
  </enumValues>
  <enumValues>
    <name>G</name>
  </enumValues>
  <enumValues>
    <name>WC</name>
  </enumValues>
  <enumValues>
    <name>CERT</name>
  </enumValues>
  <enumValues>
    <name>VERIF</name>
  </enumValues>
  <enumValues>
    <name>CPE</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>F</name>
  </enumValues>
  <enumValues>
    <name>FL</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ИнтеграцииСБанками/ИнтеграцииСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтеграцииСБанками</name>
  <predefined>
    <items>
      <name>BAGAGE22</name>
      <description>BAGAGE22</description>
    </items>
    <items>
      <name>TBCBGE22</name>
      <description>TBCBGE22</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗначениеКонстанты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Платежи</name>
      <description>Платежи</description>
    </items>
    <items>
      <name>Поступления</name>
      <description>Поступления</description>
    </items>
    <items>
      <name>ОтрицательнаяКурсоваяРазница</name>
      <description>Отрицательная курсовая разница</description>
    </items>
    <items>
      <name>ПоложительнаяКурсоваяРазница</name>
      <description>Положительная курсовая разница</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Сотрудники</owners>
  <owners>Catalog.КодыКазначейства</owners>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкРасчетов</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыводаМесяца</name>
    <type>
      <types>EnumRef.ВариантыВыводаМесяцаВДатеДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезКопеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУказанияКПП</name>
    <type>
      <types>EnumRef.ВариантыУказанияКПП</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Documents/Конвертация/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьИнтеграциюСБанком = Справочники.ИнтеграцииСБанками.BAGAGE22.ЗначениеКонстанты;//ПолучитьФункциональнуюОпцию("ИспользоватьЗагрузкуИзБанка");
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
			Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета;
			Если ИспользоватьИнтеграциюСБанком Тогда 
				БанкОтправительРаботаетСИнтеграцией = ?(ЗначениеЗаполнено(Объект.Отправитель), Объект.Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком, ЛОЖЬ);
			Иначе
				БанкОтправительРаботаетСИнтеграцией = Ложь
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОбновитьСтатусДокументаВИнтернетБанке();
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.СоСчета") И ИспользоватьИнтеграциюСБанком Тогда 
			БанкОтправительРаботаетСИнтеграцией = Объект.Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком;
		Иначе
			БанкОтправительРаботаетСИнтеграцией = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	//Паганини_
	Если ТипЗнч(Объект.Отправитель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда 
	    БанкОтправитель = объект.Отправитель.Банк;
	КонецЕсли;
	//_Паганини
	
	НацВалюта = Константы.НациональнаяВалюта.Получить();
	
	ОграничитьТипОтправительПолучатель();
	ОбновитьОстаткиДенежныхСредствОтправитель();
	ОбновитьОстаткиДенежныхСредствПолучатель();
	УстановитьВидимостьИДоступность();
	
	УстановитьЗаголовкиОтрпвительПолучатель();
	
	ПолучитьИнформациюКоммерческогоКроссКурсов();
	
	//+++ Дмгг
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПустойРеквизитСтатьяВДокументах") Тогда 
		Объект.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиОтрпвительПолучатель()

	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.Касса Тогда 
		Элементы.Отправитель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='სალარო';ru='Касса';en='Cashbox'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
		Элементы.Получатель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='სალარო (მიმღები)';ru='Касса (получатель)';en='Cash box (receiver)'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета Тогда
		Элементы.Отправитель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='ანგარიში';ru='Счет';en='Score'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
		Элементы.Получатель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='ანგარიში (მიმღები)';ru='Счет (получатель)';en='Account (the recipient)'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.Подотчетник Тогда
		Элементы.Отправитель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='ანგარიში';ru='Счет';en='Score'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
		Элементы.Получатель.Заголовок = Новый ФорматированнаяСтрока(НСтр("ka='ანგარიში (მიმღები)';ru='Счет (получатель)';en='Account (the recipient)'"), , ЦветаСтиля.ТекстВторостепеннойНадписи);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность(ИзмененВидОперации = Ложь)
	
	Элементы.Подотчетник.Видимость = Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.Подотчетник;
	
	Элементы.Отправитель.Видимость = Объект.ВидОперации <> Перечисления.ВидыОперацийКонвертация.Подотчетник;
	Элементы.Получатель.Видимость = Объект.ВидОперации <> Перечисления.ВидыОперацийКонвертация.Подотчетник;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.СоСчета") 
		И БанкОтправительРаботаетСИнтеграцией Тогда
		
		Элементы.КоммерческийКурс.Видимость = ИспользоватьИнтеграциюСБанком;
		Элементы.КроссКуср.Видимость = ИспользоватьИнтеграциюСБанком;
		Элементы.ГруппаДанныеИнтернетБанка.Видимость = ИспользоватьИнтеграциюСБанком;
	Иначе 
		Элементы.ГруппаДанныеИнтернетБанка.Видимость = Ложь;
		Элементы.КоммерческийКурс.Видимость = Ложь;
		Элементы.КроссКуср.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Процедура ОбновитьОстаткиДенежныхСредствОтправитель()
	
	Элементы.ОстатокДенежныхСредствОправитель.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Отправитель);
	ОстатокДенежныхСредствОтправитель = 0;
	
	Если НЕ Элементы.ОстатокДенежныхСредствОправитель.Видимость Тогда
		//Только для новых объектов
		Элементы.Отправитель.АвтоМаксимальнаяШирина = Истина;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Отправитель.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Отправитель.МаксимальнаяШирина = 22;
	Элементы.ОстатокДенежныхСредствОправитель.Заголовок = ДвиженияДенежныхСредствВызовСервера.ЗаголовокНадписиОстатковДС(Объект.Отправитель, Объект.Организация, ОстатокДенежныхСредствОтправитель);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиДенежныхСредствПолучатель()

	Элементы.ОстатокДенежныхСредствПолучатель.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Получатель);
	ОстатокДенежныхСредствПолучатель = 0;	

	Если НЕ Элементы.ОстатокДенежныхСредствПолучатель.Видимость Тогда
		//Только для новых объектов
		Элементы.Получатель.АвтоМаксимальнаяШирина = Истина;
		
		Если ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Получатель.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Получатель.МаксимальнаяШирина = 22;
	Элементы.ОстатокДенежныхСредствПолучатель.Заголовок = ДвиженияДенежныхСредствВызовСервера.ЗаголовокНадписиОстатковДС(Объект.Получатель, Объект.Организация, ОстатокДенежныхСредствПолучатель);

КонецПроцедуры

&НаСервере
Процедура ОграничитьТипОтправительПолучатель(ИзменениеВидаОперации = ЛОЖЬ)
	
	Элементы.Отправитель.ВыбиратьТип = Ложь;
	Элементы.Получатель.ВыбиратьТип = Ложь;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.СоСчета") Тогда 
		Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Если ИзменениеВидаОперации Тогда 
			Объект.Отправитель = Справочники.БанковскиеСчета.ПустаяСсылка();
			Объект.Получатель = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Касса") Тогда 
		Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		Если ИзменениеВидаОперации Тогда
			Объект.Отправитель = Справочники.Кассы.ПустаяСсылка();
			Объект.Получатель = Справочники.Кассы.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник") Тогда 
		Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		Если ИзменениеВидаОперации Тогда
			Объект.Отправитель = Справочники.БанковскиеСчета.ПустаяСсылка();
			Объект.Получатель = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОграничитьТипОтправительПолучатель(Истина);
	УстановитьВидимостьИДоступность();
	УстановитьЗаголовкиОтрпвительПолучатель();
	УстановитьВидПоляВалют();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидПоляВалют()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.СоСчета") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Касса") Тогда 
		Элементы.ВалютаОтправитель.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.ВалютаПолучатель.Вид = ВидПоляФормы.ПолеНадписи;
	Иначе 
		
		Элементы.ВалютаОтправитель.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ВалютаПолучатель.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВалютуПоУмолчанию(ОтправительПолучатель)
	
	Если ОтправительПолучатель = "Отправитель" Тогда 
		Если ТипЗнч(Объект.Отправитель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда 
			Объект.ВалютаОтправитель = Объект.Отправитель.ВалютаДенежныхСредств;
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаОтправитель));
			
			Объект.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			Объект.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			//Паганини_
		    БанкОтправитель = объект.Отправитель.Банк;
			Если ЗначениеЗаполнено(Объект.Получатель) И НЕ Объект.Получатель.Банк = БанкОтправитель Тогда
				Объект.Получатель = Неопределено;
			КонецЕсли;
			//_Паганини
		ИначеЕсли ТипЗнч(Объект.Отправитель) = Тип("СправочникСсылка.Кассы") Тогда
			Объект.ВалютаОтправитель = ПолучитьВалютуПоУмолчаниюКассыНаСервере(Объект.Отправитель);
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаОтправитель));
			
			Объект.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			Объект.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		ИначеЕсли ТипЗнч(Объект.Отправитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Объект.ВалютаОтправитель = Константы.ВалютаУчета.Получить();
			Объект.КурсОтправитель = 1;
			Объект.КратностьОтправитель = 1;
		КонецЕсли;
	ИначеЕсли ОтправительПолучатель = "Получатель" Тогда 
		Если ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Объект.ВалютаПолучатель = Объект.Получатель.ВалютаДенежныхСредств;
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаПолучатель));
			
			Объект.КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			Объект.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
			
			БанкОтправитель = объект.Отправитель.Банк;
			
		ИначеЕсли ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Кассы") Тогда
			Объект.ВалютаПолучатель = ПолучитьВалютуПоУмолчаниюКассыНаСервере(Объект.Получатель);
			СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаПолучатель));
			
			Объект.КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
			Объект.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
		ИначеЕсли ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Сотрудники") Тогда
			Объект.ВалютаОтправитель = Константы.ВалютаУчета.Получить();
			Объект.КурсПолучатель = 1;
			Объект.КратностьПолучатель = 1;
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуПоУмолчаниюКассыНаСервере(Касса)
	
	Возврат Касса.ВалютаПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	
	УстановитьВалютуПоУмолчанию("Отправитель");
	ОбновитьОстаткиДенежныхСредствОтправитель();
	
	ПолучитьИнформациюКоммерческогоКроссКурсов();
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	УстановитьВалютуПоУмолчанию("Получатель");
	ОбновитьОстаткиДенежныхСредствПолучатель();
	
	ПолучитьИнформациюКоммерческогоКроссКурсов();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКонвертацииПриИзменении(Элемент)
	
	РасчитатьСуммуПолучателя();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммуПолучателя()
	
	Если НЕ ЗначениеЗаполнено(Объект.КурсПолучатель) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьИнтеграциюСБанком 
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.СоСчета") 
		И БанкОтправительРаботаетСИнтеграцией Тогда
		
		Если НацВалюта = Объект.ВалютаОтправитель ИЛИ НацВалюта = Объект.ВалютаПолучатель Тогда 
			
			Если Объект.ВалютаОтправитель = НацВалюта И НацВалюта <> Объект.ВалютаПолучатель Тогда 
				Объект.СуммаПолучено = Объект.СуммаКонвертации / Объект.КоммерческийКурс; //кратность = 1
			ИначеЕсли Объект.ВалютаОтправитель <> НацВалюта И НацВалюта = Объект.ВалютаПолучатель Тогда 
				Объект.СуммаПолучено = Объект.СуммаКонвертации * Объект.КоммерческийКурс;
			КонецЕсли;
			
		Иначе
			
			// Крос Курс учитывает отправителя и получателя
			Объект.СуммаПолучено = Объект.СуммаКонвертации * Объект.КроссКурс;
		КонецЕсли;
		
	Иначе 
		Объект.СуммаПолучено = Объект.СуммаКонвертации * (Объект.КурсОтправитель * Объект.КратностьПолучатель) / (Объект.КурсПолучатель * Объект.КратностьОтправитель);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДенежныхСредствОправительНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетДенежныеСредства(Объект.Отправитель, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокДенежныхСредствПолучательНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетДенежныеСредства(Объект.Получатель, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	РасчитатьСуммуПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОтправительПриИзменении(Элемент)
	ОбновитьКурсКратность("Отправитель");
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПолучательПриИзменении(Элемент)
	ОбновитьКурсКратность("Получатель");
КонецПроцедуры


&НаСервере
Процедура ОбновитьКурсКратность(ОтправительПолучатель)
	
	Если ОтправительПолучатель = "Отправитель" Тогда 
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаОтправитель));
		
		Объект.КурсОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		Объект.КратностьОтправитель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
	ИначеЕсли ОтправительПолучатель = "Получатель" Тогда 
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаПолучатель));
		
		Объект.КурсПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
		Объект.КратностьПолучатель = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИнформациюКоммерческогоКроссКурсов()

	Если НЕ Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьИнтеграциюСБанком Тогда 
		Возврат;
	КонецЕсли;
	
	БанкОтправительРаботаетСИнтеграцией = Объект.Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком;
	
	Если НЕ БанкОтправительРаботаетСИнтеграцией Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Получатель) <> Тип("СправочникСсылка.БанковскиеСчета") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Получатель)
		ИЛИ ТипЗнч(Объект.Отправитель) <> Тип("СправочникСсылка.БанковскиеСчета") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Отправитель) Тогда 
		
		Объект.КоммерческийКурс = 1;
		объект.КроссКурс = 1;
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Получатель.Банк <> Объект.Отправитель.Банк Тогда 
		Объект.КоммерческийКурс = 1;
		объект.КроссКурс = 1;
		Возврат;
	КонецЕсли;
	
	ДатаСреда = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(), Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютБанковСрезПоследних.Период,
		|	ВЫБОР
		|		КОГДА КурсыВалютБанковСрезПоследних.ВидКурса = ЗНАЧЕНИЕ(Перечисление.ВидыКурсовВалютБанка.Коммерческий)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоКоммерческий,
		|	КурсыВалютБанковСрезПоследних.Банк,
		|	КурсыВалютБанковСрезПоследних.Валюта,
		|	КурсыВалютБанковСрезПоследних.ВалютаПокупки,
		|	КурсыВалютБанковСрезПоследних.ВалютаПродажи,
		|	КурсыВалютБанковСрезПоследних.КурсПокупки,
		|	КурсыВалютБанковСрезПоследних.КратностьПокупки,
		|	КурсыВалютБанковСрезПоследних.КурсПродажи,
		|	КурсыВалютБанковСрезПоследних.КратностьПродажи,
		|	КурсыВалютБанковСрезПоследних.КурсКросс,
		|	КурсыВалютБанковСрезПоследних.КратностьКросс
		|ИЗ
		|	РегистрСведений.КурсыВалютБанков.СрезПоследних(
		|			&НаДату,
		|			Банк = &Банк
		|				И (Валюта = &Валюта
		|					ИЛИ ВалютаПокупки = &ВалютаПокупки
		|						И ВалютаПродажи = &ВалютаПродажи)) КАК КурсыВалютБанковСрезПоследних";
	
	Запрос.УстановитьПараметр("Банк", Объект.Отправитель.Банк);
	Запрос.УстановитьПараметр("Валюта", ?(Объект.КурсОтправитель = 1, Объект.ВалютаПолучатель, Объект.ВалютаОтправитель));
	Запрос.УстановитьПараметр("ВалютаПокупки", Объект.ВалютаОтправитель);
	Запрос.УстановитьПараметр("ВалютаПродажи", Объект.ВалютаПолучатель);
	Запрос.УстановитьПараметр("НаДату", ДатаСреда);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЭтоКоммерческий Тогда 
			Если НацВалюта = Объект.ВалютаОтправитель Тогда 
				Объект.КоммерческийКурс = ВыборкаДетальныеЗаписи.КурсПокупки;
			ИначеЕсли НацВалюта = Объект.ВалютаПолучатель Тогда 
				Объект.КоммерческийКурс = ВыборкаДетальныеЗаписи.КурсПродажи;
			Иначе 
				Объект.КоммерческийКурс = 1;
			КонецЕсли;
		ИНаче
			объект.КроссКурс =ВыборкаДетальныеЗаписи.КурсКросс;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусДокументаВИнтернетБанке()
	
	Если ИспользоватьИнтеграциюСБанком И БанкОтправительРаботаетСИнтеграцией Тогда 
		
		СоответствиеДокумента = Обработки.ИнтеграцияСБанком.ПолучитьДанныеДокументовПоИнтернетБанку(Объект.Ссылка, ТекущаяДата());
		
		ДанныеДокумента = СоответствиеДокумента.Получить(Объект.Ссылка);
		
		Если ДанныеДокумента <> Неопределено Тогда 
			СтатусДокумментаВИнтернетБанке = ДанныеДокумента.Статус;
			НомерДокументаВИнтернетБанке = ДанныеДокумента.УИД;
			
			Если ДанныеДокумента.Выгружено Тогда 
				Выгружено = Истина;
				Элементы.ДекорацияВыгружено.Заголовок = НСтр("ka='Выгружен';ru='Выгружен';en='unloaded'");
				Элементы.ДекорацияВыгружено.ЦветТекста = Новый Цвет(0,255,0);
			Иначе
				Выгружено = Ложь;
				Элементы.ДекорацияВыгружено.Заголовок = НСтр("ka='Не выгружен';ru='Не выгружен';en='not unloaded'");
				Элементы.ДекорацияВыгружено.ЦветТекста = Новый Цвет(255,0,0);
			КонецЕсли;
			
			
		Иначе 
			
			СтатусДокумментаВИнтернетБанке = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВИнтернетБанке.ПрисутствуетТолькоВТекущейБазе");
			НомерДокументаВИнтернетБанке = "";
			Выгружено = Ложь;
			Элементы.ДекорацияВыгружено.Заголовок = НСтр("ka='Не выгружен';ru='Не выгружен';en='not unloaded'");
			Элементы.ДекорацияВыгружено.ЦветТекста = Новый Цвет(255,0,0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОбновитьСтатутДокументаИнтернетБанкНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбновитьСтатутДокументаИнтернетБанкНаСервере()
	
	Если НЕ ИспользоватьИнтеграциюСБанком 
		И БанкОтправительРаботаетСИнтеграцией Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ДокументСсылка", Объект.Ссылка);
	тзСрезСтатусов = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних(ТекущаяДата(), СтруктураОтбора);
	Если тзСрезСтатусов.Количество() > 0 Тогда 
		//Обновим статус
		СтатусДокумментаВИнтернетБанке = тзСрезСтатусов[0].СтатусДокументаВИнтернетБанке;
		
	Иначе
		//Еще нет ни однойЗаписи. Создадим
		Если Объект.ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета Тогда
			ДатаЗаписи = ТекущаяДата();
			НаборЗаписейСтатусыДокументовВИнтернетБанке = РегистрыСведений.СтатусыДокументовВИнтернетБанке.СоздатьНаборЗаписей();
			НаборЗаписейСтатусыДокументовВИнтернетБанке.Отбор.ДокументСсылка.Установить(Объект.Ссылка);
			НаборЗаписейСтатусыДокументовВИнтернетБанке.Отбор.Период.Установить(ДатаЗаписи);
			НаборЗаписейСтатусыДокументовВИнтернетБанке.Отбор.Банк.Установить(Объект.Отправитель.Банк);
			
			Запись = НаборЗаписейСтатусыДокументовВИнтернетБанке.Добавить();
			Запись.ДокументСсылка = Объект.Ссылка;
			Запись.Период = ДатаЗаписи;
			Запись.Банк		= Объект.Отправитель.Банк;
			Запись.СтатусДокументаВИнтернетБанке = Перечисления.СтатусыДокументовВИнтернетБанке.ПрисутствуетТолькоВТекущейБазе;
			
			НаборЗаписейСтатусыДокументовВИнтернетБанке.Записать();
		КонецЕсли;
		//Запись.УИДДокументаВБанке
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюВПоИнтернетБанку(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ОбновитьСтатусДокументаВИнтернетБанке();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтеграцияСБанком_ВыгрузкаЗавершина" Тогда
		
		Если Параметр.Свойство("ВыгруженныеСсылки") Тогда
			ОбновитьСтатусДокументаВИнтернетБанке();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановитьВалютуПоУмолчанию("Отправитель");
	УстановитьВалютуПоУмолчанию("Получатель");
	
	Если ИспользоватьИнтеграциюСБанком Тогда 
		ПолучитьИнформациюКоммерческогоКроссКурсов();
	КонецЕсли;
	
	РасчитатьСуммуПолучателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
